"""
Формат вхідних даних:

У першому рядку вхідних даних задано число N — кількість вершин у графі.
Далі йде N рядків по N чисел — матриця суміжності графа G.

У матриці суміжності елемент G[i][j] = 1, якщо існує ребро, що з’єднує вершини i і j.
G[i][j] = 0 — в іншому випадку.
"""


# Зчитуємо кількість вершин у графі
n = int(input())  

# Зчитуємо матрицю суміжності розміром n x n
# Кожен рядок вводиться як список чисел (0 або 1)
matrix = [list(map(int, input().split())) for _ in range(n)]

# Для кожної вершини j будемо обчислювати:
# - in_deg: кількість входів у вершину (вхідний ступінь)
# - out_deg: кількість виходів із вершини (вихідний ступінь)
for j in range(n):
    in_deg = 0    # Початкове значення входів — 0
    out_deg = 0   # Початкове значення виходів — 0

    # Перебираємо всі вершини i, щоб перевірити:
    for i in range(n):
        # Якщо у матриці на позиції [i][j] стоїть 1, значить є ребро з вершини i в j
        # Це означає, що в j входить одне ребро — збільшуємо in_deg
        if matrix[i][j] == 1:
            in_deg += 1

        # Якщо у матриці на позиції [j][i] стоїть 1, значить є ребро з вершини j в i
        # Це означає, що з j виходить одне ребро — збільшуємо out_deg
        if matrix[j][i] == 1:
            out_deg += 1

    # Виводимо кількість входів і виходів для вершини j
    print(in_deg, out_deg)